architecture/dependency.dot
strict digraph "dependency-cruiser output"{
    rankdir="LR" splines="true" overlap="false" nodesep="0.16" ranksep="0.18" fontname="Helvetica-bold" fontsize="9" style="rounded,bold,filled" fillcolor="#ffffff" compound="true"
    node [shape="box" style="rounded, filled" height="0.2" color="black" fillcolor="#ffffcc" fontcolor="black" fontname="Helvetica" fontsize="9"]
    edge [arrowhead="normal" arrowsize="0.6" penwidth="2.0" color="#00000033" fontname="Helvetica" fontsize="9"]

    subgraph "cluster_src" {label="src" subgraph "cluster_src/domain" {label="domain" subgraph "cluster_src/domain/entities" {label="entities" "src/domain/entities/money.ts" [label=<money.ts> tooltip="money.ts" URL="https://github.com/tkntkn/clean-architecture-vending-machine/blob/main/src/domain/entities/money.ts" fillcolor="#ddfeff"] } } }
    "src/domain/entities/money.ts" -> "src/utils/nominal.ts"
    subgraph "cluster_src" {label="src" subgraph "cluster_src/domain" {label="domain" subgraph "cluster_src/domain/flows" {label="flows" "src/domain/flows/earnMoney.ts" [label=<earnMoney.ts> tooltip="earnMoney.ts" URL="https://github.com/tkntkn/clean-architecture-vending-machine/blob/main/src/domain/flows/earnMoney.ts" fillcolor="#ddfeff"] } } }
    "src/domain/flows/earnMoney.ts" -> "src/domain/entities/money.ts"
    subgraph "cluster_src" {label="src" subgraph "cluster_src/domain" {label="domain" subgraph "cluster_src/domain/flows" {label="flows" "src/domain/flows/insertMoney.ts" [label=<insertMoney.ts> tooltip="insertMoney.ts" URL="https://github.com/tkntkn/clean-architecture-vending-machine/blob/main/src/domain/flows/insertMoney.ts" fillcolor="#ddfeff"] } } }
    "src/domain/flows/insertMoney.ts" -> "src/domain/entities/money.ts"
    "src/domain/flows/insertMoney.ts" -> "src/utils/PromiseHelper.ts"
    "src/domain/flows/insertMoney.ts" -> "src/utils/SwitchCaseHelper.ts"
    subgraph "cluster_src" {label="src" subgraph "cluster_src/domain" {label="domain" subgraph "cluster_src/domain/flows" {label="flows" "src/domain/flows/returnMoney.ts" [label=<returnMoney.ts> tooltip="returnMoney.ts" URL="https://github.com/tkntkn/clean-architecture-vending-machine/blob/main/src/domain/flows/returnMoney.ts" fillcolor="#ddfeff"] } } }
    "src/domain/flows/returnMoney.ts" -> "src/domain/entities/money.ts"
    subgraph "cluster_src" {label="src" subgraph "cluster_src/interface" {label="interface" subgraph "cluster_src/interface/assets" {label="assets" "src/interface/assets/react.svg" [label=<react.svg> tooltip="react.svg" URL="https://github.com/tkntkn/clean-architecture-vending-machine/blob/main/src/interface/assets/react.svg" ] } } }
    subgraph "cluster_src" {label="src" subgraph "cluster_src/interface" {label="interface" subgraph "cluster_src/interface/components" {label="components" "src/interface/components/Wallet.tsx" [label=<Wallet.tsx> tooltip="Wallet.tsx" URL="https://github.com/tkntkn/clean-architecture-vending-machine/blob/main/src/interface/components/Wallet.tsx" fillcolor="#bbfeff"] } } }
    "src/interface/components/Wallet.tsx" -> "src/domain/entities/money.ts"
    "src/interface/components/Wallet.tsx" -> "src/interface/components/WalletItem.tsx"
    "src/interface/components/Wallet.tsx" -> "src/utils/ArrayHelper.ts"
    "src/interface/components/Wallet.tsx" -> "src/utils/hooks.ts"
    subgraph "cluster_src" {label="src" subgraph "cluster_src/interface" {label="interface" subgraph "cluster_src/interface/components" {label="components" "src/interface/components/WalletItem.css" [label=<WalletItem.css> tooltip="WalletItem.css" URL="https://github.com/tkntkn/clean-architecture-vending-machine/blob/main/src/interface/components/WalletItem.css" ] } } }
    subgraph "cluster_src" {label="src" subgraph "cluster_src/interface" {label="interface" subgraph "cluster_src/interface/components" {label="components" "src/interface/components/WalletItem.tsx" [label=<WalletItem.tsx> tooltip="WalletItem.tsx" URL="https://github.com/tkntkn/clean-architecture-vending-machine/blob/main/src/interface/components/WalletItem.tsx" fillcolor="#bbfeff"] } } }
    "src/interface/components/WalletItem.tsx" -> "src/interface/components/WalletItem.css"
    "src/interface/components/WalletItem.tsx" -> "src/domain/entities/money.ts"
    "src/interface/components/WalletItem.tsx" -> "src/utils/DragAndDropHelper.ts"
    "src/interface/components/WalletItem.tsx" -> "src/utils/PromiseHelper.ts"
    subgraph "cluster_src" {label="src" subgraph "cluster_src/interface" {label="interface" "src/interface/index.css" [label=<index.css> tooltip="index.css" URL="https://github.com/tkntkn/clean-architecture-vending-machine/blob/main/src/interface/index.css" ] } }
    subgraph "cluster_src" {label="src" subgraph "cluster_src/interface" {label="interface" subgraph "cluster_src/interface/pages" {label="pages" "src/interface/pages/Root.css" [label=<Root.css> tooltip="Root.css" URL="https://github.com/tkntkn/clean-architecture-vending-machine/blob/main/src/interface/pages/Root.css" ] } } }
    subgraph "cluster_src" {label="src" subgraph "cluster_src/interface" {label="interface" subgraph "cluster_src/interface/pages" {label="pages" "src/interface/pages/Root.tsx" [label=<Root.tsx> tooltip="Root.tsx" URL="https://github.com/tkntkn/clean-architecture-vending-machine/blob/main/src/interface/pages/Root.tsx" fillcolor="#bbfeff"] } } }
    "src/interface/pages/Root.tsx" -> "src/interface/assets/react.svg"
    "src/interface/pages/Root.tsx" -> "src/interface/pages/Root.css"
    subgraph "cluster_src" {label="src" subgraph "cluster_src/interface" {label="interface" subgraph "cluster_src/interface/pages" {label="pages" "src/interface/pages/VendingMachine.tsx" [label=<VendingMachine.tsx> tooltip="VendingMachine.tsx" URL="https://github.com/tkntkn/clean-architecture-vending-machine/blob/main/src/interface/pages/VendingMachine.tsx" fillcolor="#bbfeff"] } } }
    "src/interface/pages/VendingMachine.tsx" -> "src/domain/entities/money.ts"
    "src/interface/pages/VendingMachine.tsx" -> "src/domain/flows/earnMoney.ts"
    "src/interface/pages/VendingMachine.tsx" -> "src/domain/flows/insertMoney.ts"
    "src/interface/pages/VendingMachine.tsx" -> "src/domain/flows/returnMoney.ts"
    "src/interface/pages/VendingMachine.tsx" -> "src/interface/components/Wallet.tsx"
    "src/interface/pages/VendingMachine.tsx" -> "src/interface/components/WalletItem.tsx"
    "src/interface/pages/VendingMachine.tsx" -> "src/utils/hooks.ts"
    "src/interface/pages/VendingMachine.tsx" -> "src/utils/MathHelper.ts"
    subgraph "cluster_src" {label="src" "src/main.tsx" [label=<main.tsx> tooltip="main.tsx" URL="https://github.com/tkntkn/clean-architecture-vending-machine/blob/main/src/main.tsx" fillcolor="#bbfeff"] }
    "src/main.tsx" -> "src/interface/index.css"
    "src/main.tsx" -> "src/interface/pages/Root.tsx"
    "src/main.tsx" -> "src/interface/pages/VendingMachine.tsx"
    subgraph "cluster_src" {label="src" subgraph "cluster_src/utils" {label="utils" "src/utils/ArrayHelper.ts" [label=<ArrayHelper.ts> tooltip="ArrayHelper.ts" URL="https://github.com/tkntkn/clean-architecture-vending-machine/blob/main/src/utils/ArrayHelper.ts" fillcolor="#ddfeff"] } }
    subgraph "cluster_src" {label="src" subgraph "cluster_src/utils" {label="utils" "src/utils/DragAndDropHelper.ts" [label=<DragAndDropHelper.ts> tooltip="DragAndDropHelper.ts" URL="https://github.com/tkntkn/clean-architecture-vending-machine/blob/main/src/utils/DragAndDropHelper.ts" fillcolor="#ddfeff"] } }
    subgraph "cluster_src" {label="src" subgraph "cluster_src/utils" {label="utils" "src/utils/ElementHelper.ts" [label=<ElementHelper.ts> tooltip="ElementHelper.ts" URL="https://github.com/tkntkn/clean-architecture-vending-machine/blob/main/src/utils/ElementHelper.ts" fillcolor="#ddfeff"] } }
    subgraph "cluster_src" {label="src" subgraph "cluster_src/utils" {label="utils" "src/utils/MathHelper.ts" [label=<MathHelper.ts> tooltip="MathHelper.ts" URL="https://github.com/tkntkn/clean-architecture-vending-machine/blob/main/src/utils/MathHelper.ts" fillcolor="#ddfeff"] } }
    subgraph "cluster_src" {label="src" subgraph "cluster_src/utils" {label="utils" "src/utils/PromiseHelper.ts" [label=<PromiseHelper.ts> tooltip="PromiseHelper.ts" URL="https://github.com/tkntkn/clean-architecture-vending-machine/blob/main/src/utils/PromiseHelper.ts" fillcolor="#ddfeff"] } }
    subgraph "cluster_src" {label="src" subgraph "cluster_src/utils" {label="utils" "src/utils/StorybookHelper.ts" [label=<StorybookHelper.ts> tooltip="StorybookHelper.ts" URL="https://github.com/tkntkn/clean-architecture-vending-machine/blob/main/src/utils/StorybookHelper.ts" fillcolor="#ddfeff"] } }
    "src/utils/StorybookHelper.ts" -> "src/utils/ArrayHelper.ts"
    "src/utils/StorybookHelper.ts" -> "src/utils/ElementHelper.ts"
    "src/utils/StorybookHelper.ts" -> "src/utils/PromiseHelper.ts"
    "src/utils/StorybookHelper.ts" -> "src/utils/Vector.ts"
    subgraph "cluster_src" {label="src" subgraph "cluster_src/utils" {label="utils" "src/utils/SwitchCaseHelper.ts" [label=<SwitchCaseHelper.ts> tooltip="SwitchCaseHelper.ts" URL="https://github.com/tkntkn/clean-architecture-vending-machine/blob/main/src/utils/SwitchCaseHelper.ts" fillcolor="#ddfeff"] } }
    subgraph "cluster_src" {label="src" subgraph "cluster_src/utils" {label="utils" "src/utils/Vector.ts" [label=<Vector.ts> tooltip="Vector.ts" URL="https://github.com/tkntkn/clean-architecture-vending-machine/blob/main/src/utils/Vector.ts" fillcolor="#ddfeff"] } }
    subgraph "cluster_src" {label="src" subgraph "cluster_src/utils" {label="utils" "src/utils/hooks.ts" [label=<hooks.ts> tooltip="hooks.ts" URL="https://github.com/tkntkn/clean-architecture-vending-machine/blob/main/src/utils/hooks.ts" fillcolor="#ddfeff"] } }
    subgraph "cluster_src" {label="src" subgraph "cluster_src/utils" {label="utils" "src/utils/nominal.ts" [label=<nominal.ts> tooltip="nominal.ts" URL="https://github.com/tkntkn/clean-architecture-vending-machine/blob/main/src/utils/nominal.ts" fillcolor="#ddfeff"] } }
}
